src/Documents/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственныйКалендарь</name>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаИзмененийКалендаря</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДня</name>
      <type>
        <types>EnumRef.СтатусДня</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/СтатусДня/СтатусДня.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусДня</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Нерабочий</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПроизводственныйКалендарь/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИнициализацияКалендаря();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ИнициализацияКалендаря();
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриВыводеПериода(Элемент, ОформлениеПериода)
//	Для Каждого Дата Из ОформлениеПериода.Даты Цикл
		Для Каждого Строка Из Объект.ТаблицаИзмененийКалендаря Цикл
			Дата = ОформлениеПериода.Даты.Получить(Строка.Дата);
			Если Дата <> Неопределено Тогда
				Дата.Значение.ЦветФона = WebЦвета.БледноМиндальный;
				
			КонецЕсли;
		КонецЦикла;
//	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Рабочий(Команда)
	ДобавитьДеньВТаблицуИзмененийКалендаря(Истина);
	Элементы.Календарь.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Нерабочий(Команда)
	ДобавитьДеньВТаблицуИзмененийКалендаря(Ложь);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ДобавитьДеньВТаблицуИзмененийКалендаря(РабочийЛиДень)
//	Элементы.Календарь.
	Для Каждого Элемент Из Элементы.Календарь.ВыделенныеДаты Цикл
		Строка = Объект.ТаблицаИзмененийКалендаря.Добавить();
		Строка.Дата = Элемент;
		Если РабочийЛиДень Тогда
			Строка.СтатусДня = Перечисления.СтатусДня.Рабочий;
		Иначе
			Строка.СтатусДня = Перечисления.СтатусДня.Нерабочий;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияКалендаря()
	Элементы.Календарь.НачалоПериодаОтображения = НачалоГода(Объект.Год);
	Элементы.Календарь.КонецПериодаОтображения = КонецГода(Объект.Год);
//	Элементы.Календарь.КонтекстноеМеню.Видимость= Истина;
КонецПроцедуры
#КонецОбласти
